УТ/src/Catalogs/CRM_ИсточникиПолученияЛидов/CRM_ИсточникиПолученияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ИсточникиПолученияЛидов</name>
  <comment>АПК:265 не проверять на орфографию имя</comment>
  <attributes>
    <name>CRM_UTM_medium</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_UTM_pos</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_UTM_source</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДлительностьОжиданияСвязыванияЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИдентификаторСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьCallTracking</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникПолученияАналитики</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиРекламныхКампаний</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НомерПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Сайт</name>
    <type>
      <types>CatalogRef.CRM_Сайты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГенераторЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГенераторЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПервичногоИнтереса</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналПервичногоИнтереса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>EnumRef.CRM_CallTrakingСценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧастьСопоставлениеРеквизитов</name>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПоиск</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитЗаголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>UTM_Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Пример</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПользовательский</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДанныеПоИсточникам</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Служебный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/CRM_CallTrakingСценарии/CRM_CallTrakingСценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_CallTrakingСценарии</name>
  <enumValues>
    <name>Comagic</name>
  </enumValues>
  <enumValues>
    <name>ПочтовоеСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>Roistat</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийAPI</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>JivoSite</name>
  </enumValues>
  <enumValues>
    <name>UIS</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_ИсточникиПолученияЛидов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЭтоНовый; // Показывает, что был записан новый объект.
                // Используются в обработчике события ПриЗаписи.

#КонецОбласти

#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЪЕКТА
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяРегламентноеЗадание() И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСквознуюАналитику") Тогда
		
		Если Сценарий = Перечисления.CRM_CallTrakingСценарии.Comagic
			ИЛИ Сценарий = Перечисления.CRM_CallTrakingСценарии.UIS Тогда
			Константы.сфпИспользоватьCoMagic.Установить(Включено);
			Константы.сфпЛогинCoMagic.Установить(Логин);
			Константы.сфпПарольCoMagic.Установить(Пароль);
		КонецЕсли;

		Если ПометкаУдаления Тогда
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Попытка
					GUIDЗадания = Ссылка.УникальныйИдентификатор();
					НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Ключ", GUIDЗадания));
					Если НайденныеЗадания.Количество() > 0 Тогда
						НайденныеЗадания[0].Удалить();
					КонецЕсли;
				Исключение
					Возврат;
				КонецПопытки;
			КонецЕсли;
		Иначе
			Если ДополнительныеСвойства.Свойство("АдресРасписания")
				 И ЗначениеЗаполнено(ДополнительныеСвойства.АдресРасписания) Тогда
				  ТекАдрес = ДополнительныеСвойства.АдресРасписания;
			Иначе
				  ТекАдрес = АдресРасписания;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекАдрес) Тогда
				CRM_СистемаСквознойАналитикиВызовСервера.CRM_ПолучитьРегЗаданияПоСценариюЛидогенерация(Ссылка,
					 Сценарий, ТекАдрес,
					 Включено);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ИспользуетсяРегламентноеЗадание()
	
	Если Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.ВнешнийAPI") ИЛИ 
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.РучнойВвод") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.Roistat") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.JivoSite") ИЛИ
		 Сценарий = ПредопределенноеЗначение("Перечисление.CRM_CallTrakingСценарии.WebService") Тогда
		Возврат Ложь;

	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = ЭтоНовый();
	
	Если ПометкаУдаления Тогда
		Включено = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
